{
    "experiences": [
        {
            "title": "Intern, Development",
            "subtitle": "Commvault",
            "workLocation": "Tinton Falls, NJ",
            "workType": "Internship",
            "workDescription": [
                "Developed Commvault Python SDK and Automation to automate the use of Commvault to protect oracle RAC wallet-based encrypted data."
            ],
            "dateText": "06/2023 – 09/2023"
        },
        {
            "title": "Software Engineer",
            "subtitle": "Commvault",
            "workLocation": "Hyderabad, India",
            "workType": "Full Time",
            "workDescription": [
                "Owned and developed protection solutions for databases such as MySQL, Oracle, Sybase, and AWS Relational DB Services for Oracle.",
                "Streamlined the design of Commvault SDK package and automated nearly 40 test cases across platforms. Delivered time-critical DB protection workflows to enterprise customers and resolved customer tickets.",
                "Developed solution to multi-stream snap-based backup of Sybase ASE achieving throughput of up to 1 TB/hr.",
                "Implemented Commvault Command Center features and have experience building REST APIs. Helped with code reviews and guiding the development efforts for SDK and Database agents.",
                "Expanded Commvault SDK (recognized as the best library for development on lib4dev.in) suite to include support for protection of Oracle Real Application Cluster Databases and Dataguard with 2 or more nodes. Collaborated in cross-team efforts to simplify API outputs using pretty APIs."
            ],
            "dateText": "07/2020 – 07/2022"
        },
        {
            "title": "Engineering Intern",
            "subtitle": "Commvault",
            "workLocation": "Hyderabad, India",
            "workType": "Internship",
            "workDescription": [
                "Completed automation projects over a span of 3 months to implement automation framework and automate backup and recovery solutions for MySQL, Oracle, and Sybase."
            ],
            "dateText": "02/2020 – 07/2020"
        },
        {
            "title": "Application Developer Intern",
            "subtitle": "NMDC Ltd",
            "workLocation": "Hyderabad, India",
            "workType": "Intern",
            "workDescription": [
                "Devised a web application to track and report on over 9000 office systems and inventory in coordination with IT and ERP departments using ASP.NET, C#, Microsoft Reporting Services, and Oracle.",
                "The 5-year-old application is in use in conjunction with new ERP tools functioning in the company intranet."
            ],
            "dateText": "06/2018 – 08/2018"
        }
    ]
}